[
    {
        "competency": "Engaging Others",
        "level": "Executive",
        "combined": "Engaging OthersExecutive",
        "description": "Show and encourage trust. Gain support for ideas through emotional and rational persuasion. Encourage healthy debate and ignite enthusiasm for change. Provide their vision for the future to inspire teams to get involved and turn vision to reality. Positive influence on others –they exemplify company values and ethical standards."
    },
    {
        "competency": "Engaging Others",
        "level": "Manager",
        "combined": "Engaging OthersManager",
        "description": "Communicate appropriately depending on audience and situation. They admit their mistakes. Facilitate sensitive discussions to resolve conflict or problems and remove barriers. Inspire their teams to strive for more, assign work based on how people work best. Use informal network of contacts to build support for new ideas."
    },
    {
        "competency": "Engaging Others",
        "level": "Supervisor",
        "combined": "Engaging OthersSupervisor",
        "description": "Use feelings and logic when convincing others, Listen, question others and show they respect others ideas, opinions and needs. Don’t mind tricky conversations, but manage their emotions and choose words carefully. Walk the talk, stand up and do what’s right for the business, customers and team. Give out work fairly."
    },
    {
        "competency": "Engaging Others",
        "level": "Individual Specialist",
        "combined": "Engaging OthersIndividual Specialist",
        "description": "Show enthusiasm, create and encourage team spirit. Work with others to overcome challenges, share knowledge in field of expertise. Respect different opinions, be considerate and be able to talk openly and honestly with colleagues. Remain impartial if the team is in conflict."
    },
    {
        "competency": "Engaging Others",
        "level": "Individual Operator",
        "combined": "Engaging OthersIndividual Operator",
        "description": "They get others involved, they communicate clearly and deal with conflict constructively."
    },
    {
        "competency": "Providing Direction",
        "level": "Executive",
        "combined": "Providing DirectionExecutive",
        "description": "Explain strategic direction to others, and how to get there, allocating responsibility appropriately so everyone knows what they have to achieve and how. Track performance by benchmarking externally. Discuss outcomes of important work or projects – what went well and where to improve. Take time to give feedback and praise people for a job well done."
    },
    {
        "competency": "Providing Direction",
        "level": "Manager",
        "combined": "Providing DirectionManager",
        "description": "Explain where the business is going to others, for cascading through teams. Links team goals to company strategy. Take action when results or performance are lower than target and will work to make things better. Seek feedback from others areas of the business. Monitors that performance improvements are being made."
    },
    {
        "competency": "Providing Direction",
        "level": "Supervisor",
        "combined": "Providing DirectionSupervisor",
        "description": "Explain how department goals fit into the organisation’s success so individuals understand the importance of their contribution. Set challenging but achievable goals, follow up on progress and share results with the team and with other depts. Give feedback that is specific and observed. Take action with performance shortfalls."
    },
    {
        "competency": "Providing Direction",
        "level": "Individual Specialist",
        "combined": "Providing DirectionIndividual Specialist",
        "description": "Can explain importance of meeting dept goals to others and knows how they as individuals contribute to the company. Follow up on progress of projects and work, communicating where results may affect others or cause potential delays or problems, give timely and specific feedback on progress. Lend a hand to meet team goals."
    },
    {
        "competency": "Providing Direction",
        "level": "Individual Operator",
        "combined": "Providing DirectionIndividual Operator",
        "description": "Understand why their job is important and let their supervisor know if their work is falling behind."
    },
    {
        "competency": "Developing Talent",
        "level": "Executive",
        "combined": "Developing TalentExecutive",
        "description": "Highlight dept’s successes across the business and recognise employees for a job well done that contributes to business success. Manage the talent pipeline to increase performance and engagement and develop potential successors."
    },
    {
        "competency": "Developing Talent",
        "level": "Manager",
        "combined": "Developing TalentManager",
        "description": "Motivated and committed to improving themselves and their teams to improve the business. Talent spotters who give people a variety of experiences to develop their skills and talents. Recognise people and celebrate team successes. Create development plans for direct reports to build their skills and improve the business."
    },
    {
        "competency": "Developing Talent",
        "level": "Supervisor",
        "combined": "Developing TalentSupervisor",
        "description": "Handle issues and problems by using a coaching approach. Talk to colleagues and team members about their careers, motivate them to keep developing and encourage developmental opportunities. Provide on job opportunities to practice new skills. Know own strengths and development areas and how the way they act affects others."
    },
    {
        "competency": "Developing Talent",
        "level": "Individual Specialist",
        "combined": "Developing TalentIndividual Specialist",
        "description": "Self-aware so they know what they are good at / what needs developing- they seek feedback on their work and make an effort to improve. They reflect on what they have done and learn from experience. Open to opportunities to develop, take part in setting their goals."
    },
    {
        "competency": "Developing Talent",
        "level": "Individual Operator",
        "combined": "Developing TalentIndividual Operator",
        "description": "They show new people how everything is done. They give feedback when someone has done a good job. They accept their mistakes and learn from them."
    }
]
